<?php
// +----------------------------------------------------------------------
// | AcShop (Acgice商城)
// +----------------------------------------------------------------------
// | 技术支持【幻神科技】: https://www.hasog.com
// +----------------------------------------------------------------------
// | 联系我们: https://oauth.acgice.com/sdk/contact.html
// +----------------------------------------------------------------------
// | gitee开源项目：https://gitee.com/orzice/acshop
// +----------------------------------------------------------------------
// | github开源项目：https://github.com/orzice/acshop
// +----------------------------------------------------------------------
// | Author：Orzice(小涛)  https://gitee.com/orzice
// +----------------------------------------------------------------------
// | DateTime：2020-12-24 16:36:19
// +----------------------------------------------------------------------
return array(
    
    // Interval定义两个run方法调用之间的时间（以分钟为单位），换句话说，将调用Cron路由或命令之间的时间
    'runInterval' => 1,
    
    
    // 启用或禁用数据库日志记录
    'databaseLogging' => true,
    
    // 仅启用或禁用记录错误作业
    'logOnlyErrorJobsToDatabase' => false,
    
    // 在多少小时后删除旧数据库条目-如果此值设置为0，则不会删除任何条目
    'deleteDatabaseEntriesAfter' => 240,
    
    //防止作业重叠-如果Cron仍在运行，则无法再次启动
    'preventOverlapping' => true,
    
    // 启用或禁用检查当前Cron运行是否及时
    'inTimeCheck' => true,
    
    // 用于保护集成Cron运行路由的Cron应用程序密钥-如果该值为空，则禁用该路由
    'cronKey' => ''
    
);