<?php
// +----------------------------------------------------------------------
// | HaSog (幻神商城系统)
// +----------------------------------------------------------------------
// | 技术支持【幻神科技】: https://www.hasog.com
// +----------------------------------------------------------------------
// | 联系我们:  https://www.hasog.com
// +----------------------------------------------------------------------
// | gitee开源项目：https://gitee.com/orzice/hasog
// +----------------------------------------------------------------------
// | github开源项目：https://github.com/orzice/hasog
// +----------------------------------------------------------------------
// | Author：Orzice(小涛)  https://gitee.com/orzice
// +----------------------------------------------------------------------
// | DateTime：2021-01-12 15:53:49
// +----------------------------------------------------------------------

use think\facade\Config;
use think\facade\Event;
use AcgCron\Cron;


return function () {
	// 设置插件
	Config::set(['hasog_view' => [
        'name' => '幻神商城默认前端',
        'version' => '1.0.0',
        'description' => '幻神商城默认前端系统,包含PC,WAP页面',
        'author' => '',
        'url' => '',
        'namespace' => 'HaSog\\plugin\\hasog_view',
        'permit' => 1,//如果不设置则不会做权限检测
        'menu' => 1,//如果不设置则不显示菜单，子菜单也将不显示
        'parents' => [],
        ]], 'plugins_menu');

};
